zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43B43ZC3/KW43B43ZC3_COMMON.h
#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field##_SHIFT)) & (field##_MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field##_MASK)) >> (field##_SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

#define RTC  SRTC_0
#define CDOG CDOG_0
#define FMU0 FMU
#define PKC0 PKC
#define CAN0 CAN_0
#define CRC0 CRC_0
#define SCG0 SCG_0
#define SFA0 SFA_0
#define CMC0 CMC_0
#define DSB0 DSB_0
#define SGI0 SGI_0
#define SPC0 SPC_0
#define WUU0 WUU_0
#define MRCC MRCC_0
#define TRNG0 TRNG_0
#define INTM0 INTM_0
#define GPIOA GPIO_A
#define GPIOB GPIO_B
#define GPIOC GPIO_C
#define GPIOD GPIO_D
#define PORTA PORT_A
#define PORTB PORT_B
#define PORTC PORT_C
#define PORTD PORT_D
#define RF_SFA SFA_0
#define LPSPI0 LPSPI_0
#define LPSPI1 LPSPI_1
#define LPSPI2 LPSPI_2
#define LPCMP0 CMP_0
#define FMU0_NS FMU_NS
#define LPTMR0 LPTMR_0
#define CCM32K CCM32K_0
#define MU0_MUA MU_0__MUA
#define MU0_MUB MU_0__MUB
#define MU1_MUA MU_1__MUA
#define MU1_MUB MU_1__MUB
#define MRCC_BASE MRCC_0_BASE
#define PORTA_BASE PORT_A_BASE
#define PORTB_BASE PORT_B_BASE
#define PORTC_BASE PORT_C_BASE
#define PORTD_BASE PORT_D_BASE
#define LPUART0 LPUART_0
#define LPUART1 LPUART_1
#define MCM PPB_MCM2_CM4
#define ADC0 HSADC_0
#define TRDC TRDC_0_MGR

#define NXP_RADIO_GEN (475)
#define RADIO_IS_GEN_4P7 (1)
#define IS_APP_CORE (1)
#define IS_RADIO_CORE (0)
#ifndef KW43_core0_SERIES
#define KW43_core0_SERIES
#endif

/*! @brief define LTC0 from LTC. */
#define LTC0 LTC

/*
 * Macros below define the chip revision.
 */
#define DEVICE_REVISION_A0     (0x10U)
#define DEVICE_REVISION_A1     (0x11U)
#define DEVICE_REVISION_A2     (0x12U)
#define DEVICE_REVISION_OTHERS (0xFFU)

#define IS_CHIP_REVISION_A0() (DEVICE_REVISION_A0 == Chip_GetVersion())
#define IS_CHIP_REVISION_A1() (DEVICE_REVISION_A1 == Chip_GetVersion())
#define IS_CHIP_REVISION_A2() (DEVICE_REVISION_A2 == Chip_GetVersion())

/*!
* @brief Get the chip value.
*
* @return chip version, 0x10: A0 version chip, 0x11: A1 version chip, 0x12: A2 version chip, 0xFF: invalid version.
*/
static inline uint8_t Chip_GetVersion(void)
{
    return DEVICE_REVISION_A0;
}

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* KW43B43ZC3_COMMON_H_ */

